app/controllers/courses_controller.rb

SELECT  "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT 1  [["id", 12]]
---
  def select
    @course=Course.find_by_id(params[:id])

SELECT "courses".* FROM "courses"
SELECT "courses".* FROM "courses" INNER JOIN "grades" ON "courses"."id" = "grades"."course_id" WHERE "grades"."user_id" = $1  [["user_id", 36]]
---
  def list
    @course=Course.all
    @course=@course-current_user.courses
    #添加是否开课
    openedcourses=[]
    @course.each do

SELECT "courses".* FROM "courses" INNER JOIN "grades" ON "courses"."id" = "grades"."course_id" WHERE "grades"."user_id" = $1  [["user_id", 36]]
---
  def select
    @course=Course.find_by_id(params[:id])

    flag=false
    flag1=false
    flag2=false
    current_user.courses.each do

SELECT  "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT 1  [["id", 9]]
---
  def quit
    @course=Course.find_by_id(params[:id])