app/controllers/grades_controller.rb

  def index
    if teacher_logged_in?
      @course=Course.find_by_id(params[:course_id])
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT 1  [["id", 4]]